tutorials/XiFluid/engine2Valve2D/system/topoSetDict_inletFuel
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict_intelFuel;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
  {
    name    inletFuelFaces;
    type    faceSet;
    action  new;
    source  boxToFace;
    box     (-0.035 -0.1 -1e-5)(0.035 0.1 1e-5);
  }
);


// ************************************************************************* //
